
//LSP:
// این اصل میگه اگر هر جای کد، فرزند خواست جای والد قرار بگیره بتواند 
//تمام رفتار های (متد) والد که به ارث برده و مورد انتظار هست را بدرستی انجام دهد

// تعریف دیگر اصل LSP
//رفتاری که همهٔ فرزندانِ کلاس والد، نمی‌توانند به‌درستی انجام دهند، نباید به‌عنوان رفتار عمومی والد قرار بگیرد.


Animal animal = new Cat();
animal.Fly();
// از نظر سیشارپ کد بالا درسته ولی فرزند نمیتونه رفتار مورد انتظار پدر را به درستی انجام دهد



Animal2 animal2 = new Cat2();
animal2.Eat();
//در کد بالا فرزند جای پدر قرار گرفته و به درستی رفتار مورد انتظار رو انجام میده




class Animal
{
    public void Eat()
    {
        //غذا خوردن
    }

    public void Fly()
    {
        //پرواز کردن
    }
}

class Bird: Animal
{

}

class Cat : Animal
{

}
//-------------------------------------------------------------
//////////اصلاح کد


class Animal2
{
    public void Eat()
    {
        //غذا خوردن
    }

 }

interface IFlyable
{
    public void Fly();
}

class Bird2 : Animal2, IFlyable
{
    public void Fly()
    {
        // پرواز کردن
    }
}

class Cat2 : Animal2
{

}

